{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_3",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              180,
              320,
              1
            ],
            "dtype": "float32",
            "name": "input_3",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_3"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_13",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_13"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_13",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_1"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_13",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_13"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_7",
            "noise_shape": null,
            "rate": 0.15,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_13",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_7"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_14",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_14"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_14",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_2"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_14",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_14"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_8",
            "noise_shape": null,
            "rate": 0.15,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_14",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_8"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_15",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_15"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_15",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_3"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_15",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_15"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_9",
            "noise_shape": null,
            "rate": 0.15,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_15",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_9"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_16",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_16"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_16",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_4"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_16",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_16"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_17",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_16",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_17"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_17",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_5"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_17",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_17"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_18",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_17",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_18"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_18",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_6"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_18",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_18"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_13",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_18",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_13"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_13",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_6"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_14",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_14"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_14",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_5"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_15",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_15"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_15",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_4"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_16",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_16"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_16",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_3"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_17",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_17"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_17",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_2"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_18",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_18"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_18",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "sigmoid",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_3"
        }
      ],
      "name": "model_3",
      "output_layers": [
        [
          "conv2d_3",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "aea846301c6603add9dfda9923763c4de7c5028a72b4d4a542c2a755224de828",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      180,
      320,
      1
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            180,
            320,
            1
          ],
          "values": [
            "LOsAwMBMoD79w5O+bRqNvssviT5JCFw/qXFQP8Idz7+I0Pg9YNkoPuC/YT8IoEO/If6avx2SbL8zQTs/O0VOP+ZCiT+2iBY+VThSP4fUbb9jXvC+P/qhvzDX7D7Y8Ce/lTvOviHglT8qE5I/6H81vpsLyb4y09g/RiErv6OdjD+PauU/orujP4/4DECQZJg/hC0jwGpIEz64TaC/c1+/v440Cr8oWZm/PrVIv19jO795pk6/uisIP9qbEj92mI4/OKm8P7FV5L7mBLO97MdeP1Hodb+J9MU8uj/7vrfoLb+HGWO/cOtVvqUSUT+PapA/C5+OPsUhmb4fMW6/2zCFPyNbLb8mCSK/T76Rv3W40r+GoKk+rsRxv+FEsD3bsZq+yLPlv4S3Kz8EVIi9Kg4AwIb3JL93+jk/mUJ+v7pMb77u1F2/w/KPPwEmXb9LQxBAeYT+PttAJsCwIKK+97/WvovVnr09O5K/Jkeqvpw5sL8+8Zg/d0PhPnkaGj48zae/0n1Fvoy+j79+Oim/QmEgP/xB1b5PVyO+qT5Xv046or625wjAZ63nP6m+Bj/Wcdk+Sd76PohQfL8ZuVi/tta8PwUZkD6tOiC/vabEPR/+PT5FZzk/JbKSv1/dOr4FJR0/mDDdvlWwGL8MSIi/oCBwv0g4Cr8ErQ09qaOLv3yUpT/o7L0++B/yvmUIjr84lDK/y9mWPywEWD82gZM/a9eDvzPMkj8ioYg/kbcxPAf2Pr/cAXG/P00rPyNuQD8nI2S/b6DcPrXGm7/9dls/ADMCQLpp3zuR1aO+vppSv23RQz5MBKO8efnzv1KTyL4WHgTAZnEMvnlLV77fTq49NLbkPkEy4r+qIYO+wd9wvtAuZT+pJ9C/MYaTv+b9pr/iDII+U2HzPl9ysj/h9Eu+7Sjkv+9XbT7ja64/V9s7vo2WRL+Jvbc/Cn/ZPTMFzb4qGco9RVRMP09CCsCcRD6/g+49v1lKv74s0LC+jOlRPXP7Bj+F/kM/kcj7Pvfy4L4bhC8/",
            "vlC+PbvABsC231g9PwYwv5Lvi77wMwBAms9sP1bO4b7HgCG/x0eOP2drkb0LSl4+tB6BPyNbB77fn0Q/tIYRwPNTIb9rzOq/pG60v0l9wT1wG3y/2qmhPy+z0r/4fuW/ixbnPs5tLD9UMrI+2ZsQvzdQ972migXAu7Wlv7KlJD317eg+xgpIv4u0nr4QF4s+PkzOP9mSAb8IbVo+qMimP9S2lj/6B5k+JefhPmSSYT8m7fu/7JQpv/sbkD/LGLE/le8GP5KNm77RGGC+T21uv5Gx5T8erbm/eKHavqsDRT3GNh9AU5GOvR6Czz9ERTc/mUwnP8+Xfb7qEZ493kUhQBizHb+RwUI8MI/7vk1/SD7nkAy/E38UPzZqn76QSeW/eMiSP7FMjj7QyMo/vt0uPxeqBD9yyrK/CaIcP+3dhb8Z5pE/VwGyPDpDxT+Tl0k9SXU+v4fvY7+Ss0w/6dv3P67Yyb//E788rAUCwBiMZD/hqC890cBJP3y23Dw2co4++YQdP6i/rT60tIC/4ZrYPnJuwr8r3XG+0vIvvg7juD2Rfn6/v26bP5V72b5we+m/WOOSviefOj9wDoi/aKDLv4AZq743Vpg/1KzFP026oD+feUc/5/4XwH8coD/UsTY+OaEhvtPVXb/WaSQ/N5RSv2JhML+CzMu/Uy7HvvkcLz9Vgwy/QwtSvy0Bpb51XQY/rzwMwMdJ1T89rN49eTB4vvOXuD+Kykm/xSq7PAy+Z794CwU+TNzJv3NqZT+l/MQ+tdl0P+nzj75VlKs/Y4TYv5ZZDsDR6Rw+2cRwvwdYWj9kHha/oWC5Pt2VA7+mvY0/dIJlP7OeRj9xZEM/7FIGQDqe0D7fOi5ALkxBvob9or94Jz+/Hl3iPoGPhz7Xe6C/hqsIwAe8hT9fS4M+NG8Yvxy2oD+zVqa/fFkVP8ZoJr9BMIo+mNdnP7Q3KcB2DAg/QeyGP8EZBL/NvdY+/LU9P7wtXD9zed6+QkdPP0kMWL4rP+49x1s5vkCqr7+D4T0/",
            "mQqovqFXlL996zA/ApohwDHBzD7iPB+/OmVsP+x9iD8VaUU/hHHxvhyCyb5rhBG/B+hAP4G2xT63R/y++GHovSKUAEAj7uo+i8V3PwcpcT5asrK+ufV6P6bNdL8OvGQ/91H7PlVgib+dch5AXdkEvQSIUz/6cAu/DgKlP5EA8L1xajlAo7+zvhXetD/o/jc/9yd5v8/h0j1+eI0/AkXvvqWlNz6vkb6/NBWmv8ekCD8ta/W905JQPmVJp76ui4A/9vQUv+cAC77uDkQ+qjHNP0WMab3ijKa/Zv5AvWGvEr/si5m/EN3avjni6z6MNxc9/+wnPeVV7j/mJLW/QpD2v5Bs+76nlFQ/sOKyv8+DGj8EPxDAMiUpPbqN3D4QUwI/bLj3v76HJD9ZNx8/iWGjv7fj5D4QlVM/gdALPz1onD6RK2+/c0LKPvIaPr5iCSu+iPPYvkVdj79YHdW+X+oAv43u3D+luGE+JmgKP5g1NL+KmLK/NWUEvx18sL/JGd+/L533vUkI/j+/LrS/W4fPv6Kch77XMfS9UaQ1P+CZvb4IypU+QK5yuwZK+r8R3le/440FP9496z+SwtQ/OqxXvBS8OL/ZIyk+TfVqPwWo7r6T3u6+D4w/PwVsir7yAoy8p/bjvDjuOsAQ7FQ/FF5FvwfujL9aK3g/EU8tvlSlXD5jgcw+2j3pvjzmBz8C1pW/wEFSvy1tyD/YA869v40uvyy4Hj+mD3s+e2uDP7G+gD9PrHw8ZDu3Ps4Hpz5dVEzABWxrPskKnT5t7ri/9tCAP8Vppr5Tq7W/MgP4PyqzkD4slfm+cmN0P8uWKr9iVhe+8tcLvyZ6kDyOOhs/yhxMv49r9j4uVTy/Rz2IPzRXfb8u+pe/aGMbv7n/Tj+2Qz4/MYbEPhAzMb9Qkwi/NDRPv6zwHj5k1q8/j4XUPfih+7+8zLa/7xZtP00xm7+vMwg+BVyZv9I7Dr+Vygq/6gfXPTeD1T+qOwC+DDfAvqEQBT+y/yg9bZWXv+cHBb+RKcS+",
            "mFA1wFhOK7+hHO29UxeQPwYJwj5kwS+/Wz/QPgxdTr4MV02/NCmSv8fOYT5ncNQ+fYupv1wE1D3XPCy/ZybYv8XNjj1vKz8+xB1RPw1wSz/HQTk+j7GVPxTz4T46hEo+sRqaP2Go8j/QtWW/iOsgP6nym78qP7U8QQq4v8/7Uj14efK/GT0dP+BygL+fFLY/ljQDPyefVb9nBKM/WCGPv/B9p74zIRY/qSWbP4cqNj/OXDxAFGq3Ppe5Ij3Gvzs/4JdiP35UmL7isuY+aKhQP6Pn3D3eLvW8MEU3v35l3r4nZY4/2+iJP38l1780C/0+lofgP1JpuTwMFfI/+0i3vtrVlD8FGbm/z1WnPzgVsj8311+9xZrrP+bqxj+2T4q/9eACwOzX/770DQHApLsRwN4GwT4zV8C/Z2H+vousTEBdQEa+35eYvzg7GL57bd6/4YDKPhK4+7/m1kM/FGxtP5iO/74kSI4+q/YcvbJo4D5ErFG/g2LqPwb9Jj84wI0/VlTjvg8plD4fDCy/3vtBv8OBMb9TYRi+YlvFva5dTb+JLU0/oZo5QIkcpL63q74/k3hgv2eLnrsEKpg96PgOvcwruj64mik/mVXVvh2GMz2LyiU/zE7KvgDAFz/5F0O+xG3VPXlKbLwlrvi+M3rYvrwxYL8CCWA8h4yCP9VbiT/mvBM/jYvPP95WjL+AmZe+Rw5vvx1dTL4/BRU/tORev5k3nL+ruo8/4ZT+Pq5zFcC+VqU/+4QOPupKmD+tXQ8/FbaHPlz6Sj5PSnQ/ceRtPyrYy7+9NBm+vaMIwKIbhL8nupU9UPTDP3xUZj+fCt2+k3LxvQL+Zj/8t1M/WK78PpvB0D9QDDc8nyeTvZ6j/D3AFzG+HJXKPwIKBz6RRue+DqfgPs5fVD5cICS/NWohPyHL9b3GmhVA+MR/vmwRB0Da1vY//oq9vyo5Ab/gGl6/zSoYvy31y74behM/MLIAP6P9Uz+CRYS+H+9ZPtlK8zz8YuO/+9AKvwtmL79uOV29",
            "jKaMP92FUj79cCA/dPz+Pqf0Cj+H4Ew/Dd4Nvukt775z+mY/TG6aPCInCr96yCm9K2NQP44k0D81ce28SdgEP3JIIj+y2gI/vBHbPltO/772jZo/fyo0P8QcNL4/qGC/UjsrP+ifgr4R17U+AGsKv7oW8L74bRc8rRAtP9jJhj6yLbO+gbPMPQ8BGj6DcFi+p+WsvgAaRj5yZ+o/OalzP32ZLj7Wb6u90DvVvp0e8r2gtbW8c8GQvz/Lpb8vqBU/ylFav+gFRL/0Ira/fW01QCIcE8Dj76u/b/8CPXel7T4vCaa/4EQaP4ZYqz/WGQxAmXY+PiLN+j23l1c/FnBrP12+B8DS7JK/ANhXvxVv/b3HpKA+snYpPXo8uj2GQBe/79ZovnM6fT6p92W/r8nCPnk98b1gXjG/YLV0vnO7Oj8DdaC+hM9hvxUoUL+Nrx0+qJtDv13eSL81NiG/dgrjv/k3BD+9/Lm/6hswPzAwBj/dFEG/1VIqvuOBDT2fLq6/ztiVvh0irb7TJe+/e7kKP5KnXT/ryXm/JFrivpZE0D/REUvAbrfkv0zXL78hiqq+19kIP3ctJz+1Mwo/NLAFP6ZpVz7jQd++qtHhvue8Sj9B+Fc/D3qMPzPorD7YfTdANb2Kv3Bnbb5QNOM/reJAPyuCBkBPgFk+2SGVvcRiXT/sUZW9kVd1vhnv9z7xCaE9Dr5xvtEJiL9fWw4/bkSjv8O/sL6OpBA9NA7CvDa4AUAWMhy/iRdRvymzXT9ibZ2/X+lWv5HfcL4uXoG/DJltP4SI+z/1QZK/w4Ssvk8SsL53b82/1SWyvxBevbxh1Vu/LSI5v6KZGUAJVVe/ATjav1QdNT8YJQk+EFcbvy0gJT+mIio+f/KMvRUVKr/AXQBAOc0rvm4HgDxBrYY/I37Pvumj6T9iFwpAuC71v/C7sD4WXwU/y4GfP6SHZD99kxC/jx0MvxrKrr/v/WO/N9cDP2FFsD58oyM9fGwCPW+7oL+H/OS+5l1xv5Fx5j/hFbi/",
            "VMClvh1t+b/0nl++gbGtv4XvMb/wFz++CiLLPjQhDT8iT7E/L/qqvn++1b/tjuE/D69zP4zowj75rao/BlR3P9xnkj6KGYK+M0g3vlWbUT8F/Iq/9LkCQMPSKb95zQY/PyvOPNKZg771HfS/bnFUvjiaSL8dU40/60ZXv0aHBkDZ81W8nqm5v/W4PkAW7gXANrhMPwE7JD7cpoW/SrDGv7dXgL9I/ru+7YdXPwty7z841wzANWZyP/v2Rb8fA8E8xWXcvle5Lr61qT9AAQdiv7qpJr/VO7S+TYVbPRNXlr4lNbM+xTnIPnHUxL7ubUs/V0rZPZhl3D7GDqg/5swJQGqfB7/KMUw/J7tWvz/PYj/l7yVAEuCcP5oC2b7wpLq/BB3uPy4eZD9VZ908h88cP44y/T/Qg66+gVMTP2dO7L49dye9iS6ZPhgqXb5Sjtu+ydgRP84Y1z+HjJo/rGL3PkVNWz5MaRO9XYi1v14Euj7EHio/CiouPrYRdj+C/ci9XQ89P0JlGb+0Va4+p7KVPspjXb8K/Zi/QlGnv9x5Wj7qua6++PI9v4ytM7+KpMu+sSdSv8Fsz77CYcM9pIsJQDC6cUBh6Ki+w6cMvz/glj9AeT4/CNyfvknItT78C9q/lpXzPpStnD9y9OO+JuUvvl3PUD41VDk9zDuQv19e1r77VgzAFH2FvwItAT+L7qO/ebGHP5/jtL70BZQ/1WADv0p6O79S/+Q90AOGv0Z7mb19BKa///K9vgRndL+aUUE9mbOEv0FqBMAWTtE/KH5OPrlsyT6LRRFA0+iivlxgZj5KjRe/OYy8Pr4yPD3Qq56+DLrdPiss8r5GeUY/9b2SPRpoi7/1pCM+hEtkPicf3b/AhnA/RxFxP5S74r01u8k+YW/1vuFEJz8z4uk/R2rHP3nCgD2PKQi/QvK+P0qWiT/3Xvy+ICYeP6Wle74UXIe+tyKdv3KpWL8xfM0/+yyjP2XQBz/Vy16+D+qJPyfSbr3yYZ6/R5q1P53vYT9E41i/",
            "ubRVPirdcD/vyps/n2u6PzNg+z5/XKO+UXgvv0K1dj87CG++SMbEv+uwGz5S/pC/GK4mP21eCz8PRNO/mq+Wv8KNJr8Pcc493huwv2aixD+lX5w/cxwdPkg0y79cpkO/xswKv1sEAz9//q2+2pQEP4iHEsBNZ0o/I325PzxWWb/5KYI/EW1iP8r5gb+X9089nPIhP5A+8T4VCUw+4YQAP0TmEr5z3RO+YtpOv1NOer/gucG/l84YQL6FoL+NvgG/O0TTvt1g9b+7WTY/rD73vnk/+L5jBYi/j/WIv4KA2D8w0ke/c2NxP3/rFL64ib++7WGFP8cuCT2zRPW+n10tP6nygD8hlmG/FN0QP4KBlz7CAqs+ufbQP9ZBVL/KTeM+NR7zvkDcCb8A05Y+HOkOPmYeb76UDQw+/x1RP3n2+T5JVF6/MG2WvEfOtryr8Wg+09uhP7N6AsA9fqI/jF2TvrslAj1YiZw+Q51CPbBaTD9kADW/gIdtPxKni75JuuI/fjkTwOaBVz7BgZs/cD/iv7CKOb5LoQe/987/Pr3akL0b45i/wBl5vtH3DcAduEe/p7ovvtBVPT9YPKm+QeKGPzoBMb8KqiK/zyOLv73LOj+kHp6/54TXvuk07j57Yl6/65tiP4wvIj/fOmc/aRmSvzhMcb/NNLo+ZD8CwBDVJD+s5xo/oFxTvtWqeL+uLJQ9QrFMP5+0yz665gnAzpk5vyKeN79mDpI+ouqAPzdYKT/a5iA8ZI4TP7vlrr456Wa/ehJGP4mICb7wZ9U//bvrPSHClL1rVio/5RnCPkl5xr1Wzcc+sdMAv/47A7902qE/maoPv/yyuT65Sca+rjElvxIt9b7GqME/Wjr6PHkxkb7lqQG/TGcnP2PfzD/7KQW+zpyAvsno0z/lPwo/euVzP4OKmj9XVym/JR1KPwfc4L4Ayp69ZanIPuHzgT5Z+YY+81//v8QbYcBgHJ0/XG+xv2O6oz+8H1K/3oEDP/E4xj6KvSm/0MsDQMqDSb6FV3Q/",
            "h9AQv+ThBT/2PkG//iLUv6bEtL/+CPO9bEukv45l57+ZdNk+2FmtPvwX1b0PHIa+Glffv5MrAD/0JBY/+H2yvrpfZb+muq48NfDyvkfcDT821Yq+wCnbvqwQ3r66scw/1/hyP1fTBr9O68G7zojjPdgjUT67lbg+e0c1P0QE3T6LTcy/Gtnuvmw9Xj9T/Kk+UkyWv66kXb+y6g9ABl1CP1EGDj/mPr0/WouFPwXmez6fJQVA3YIOOiwYVz+LnIG/BPptvwr5PD/LO16+f4LHvrqToT9LC6U+qC0iP4up9z19CDK+VRwTv267/r6JaDU/jDHDPGwSsb9cZRi/9YV4P5KPNT/CC3W/Kycuv3VpGb8mvZ+/juXivtQ9kr8eqDw/8BMtP1uSfD/dXju/COFDPrhHd7/VWFY/uBOHv8eTVr/CsSw/rhCSPne88j/O51k/iHycv7lQpD/jehy/6ExDPh2RCL+Psbo/8eTMPtm9D78Eqtu/UL89P4RBBkD6rTU9iSG4PjqGg79wmOE/XBy/v9Ch+r/pRQtA8xkRwP1gBMBvVxe/rvVXvtlYVT8XPQa/CSesvdR7nT7FlA8/WSFnP85AWL4yZK0+468IP2gEJ78cjS8/xhqoPl3lzz+ZKCQ/apVEP51wnb6uuXe+miqLvs/7gz/h7WS+haL6v1BYvD8QcLa/oRfZPsOGNz8o3n6/E+AVvhA1Eb6z0rM/s6y2PpCiyL2Ea/6+6pWFv1rKlj9Jtxe/Q6rHP7uQwD99NRe/iVqBPsUEJz4Ebeg+v2Qqv44taT9Zww4/cWXvv97r0D6/Ai++BNztPjwxGj+/xQA/4fzmvjHfgD9Op1M/a0sGvRZImz8vGa2+vJ7PPmZxhT/0w4A/FMHHPlXPVL7A5Ic/hzRjvwEECcA83k2+sfw2v/viqz4OpHE/RMh5v+MR576vD5q/mIEfPxqnHT1H7gu9tKTOv7Sl6r2oHJo/MZmNP7lSBT+6pJ89W4h/PyN2Nb4c0Ts/a9K+v7fqoT7vnt09",
            "7W6Hv+/21b8Odki/jFRJPkdHLT79aQC/rjyEP/ILrj53lMi+TDkVwCSdD78qJL+/HYpCvjU8yDlpe9++xbezPbDHgb7BusO/ytg+Prwtq7/p72o/P2BsP94J+D5wRAe/SQuPPcdlmj6MAhG+hy/Jvca8vD5FHgtAxj5TvicdAD4QDT++nMhfvhShm7/89I4+3hZGP2wPSb4RbWc9TivMPhYahz2tA42/a0qiv9ZRqz+wgMU/TN2JvfUub770jgjA1qcdP5t5ur8m5y3AVQihPk3jbT/2sIS/TA8WwDhp4j5j1E2+WwEwv3SJbL09f8K+hNe7P8TTQb+EG6u/xXz1PydTkz8GmPw/5pZ/v+lhJT9vKYS/iwbWvRPbTD87YgU+YSCuv83zvz5zBwdAJZINPu8Wm7/mUdK+555jv5S6fT9GIkK/VPYNQOOOv713vQvAo0ZwP7WrQ78pdy8+5flrv/uYUb+jJfW+HBbuPkcH0j8WvWw+S2lZPwFy+z50Ubo/OuYFv87hUj8+dTE8xmMjQF43JD8oXNU/Ccokv6bFZz/e4yS/dFo+vyUzMr6zwX2/0pLVv0RCuT2cl4u/QYNlPo3ooD1mwKm/WeKKvgh+Tz8xlcC/srvnPyWFur6F16q+m54EPwOEiL6uFua+KDBAvY6xUz+pNwE+ZHB5PwT2pL4b64u+i1WaPyyRY7+TmMa+8qWFPk5Hgr6Lses+34KCP7Wn4L3EObw/ovBJvC6owj/sjPm+4legPpbN2r/tFOK+m1GDP88/C77bkuc+jxcTPed4mT1gHsG89TwAvzvN9z564QTALcxRP+2tTL8cyX+/4kwMQFWuAb9VzIU+CYhGP5G38D5dAME9ZGQQv/d39L5QoJG+93Ylv5/R6L8EoIs/K8NsvqCiFz/8WKU+eSCvv468w79Vu0U9URuJPh8eir8Ad4U9WVsmPaGypr/gP8u+N32OPrEghz/FJaQ/z2xpPngs9j3zHJK+Zd7sPPYrBUAYpjY/xwgDQPpsvb96Gye/",
            "/elzPn1SX78aVaM/wcKbv5+4Jb83ETs+isNJP2zDEj8ONc6+jJIkPub4GD8VyfI+vKl+P3LGF7/AscO/ywpOveOPEj3vQR4/HcoIP/A9hj9O/mY+UrpFPgRJlr/mcVO/Rr0tv9tEvr54Wv2/BMCivgu1jD/o3cY/KnVmP7o38D7JlWu/mlP4vuweUD/JVui+IKmMPzfJqL5+OGc/NEQUvqXfHsAWj7E/3vtWwB+Rar9wH5o/bXK0P0OyiL4uxHG/CbUHvyr4mr9eo6C/uVEXv9me5r+ta6G/3JKGP3RE9j5t12o+1VYBQHNO4b0dzcE+M395vMVIPb+glqc/s749Pkmj67+QkEM+mDKuP/nm0D8hzUK+LXZiPqtRvD/z20e9OKZ4P8fu8T2uLyVAOtMuvoVVhb/z+N0/F7qcP2Jnf78hTti9cBI6Pymhxj5k6wJAMzWIvSxtAj6k2Fg+5C0BQEIPhr+wRjw/isV9vqyv0z5qS+s9GO5nv9GbS7+icfe/bHQwvYPUBz9EEjw/2IOOP+JXPr9opHC//sDxvqzWM7+P2ivAVw+lvvWlzz6qEGc+f9Y5P3OtwL6r5G++BYm+v29MMj62Uwg/tyarv44I6T+S6A6/zIldP7Mt/D3VeEI/dJUrvwy1Pz4DiYy/aASBvg+9JT/et7q/AaoRv+CXYD+HguS/Dhe0P+JIDMAnttW/cHiuPopGrj7PnLY+aHvJPS6BGb/YXaw9Msj6vLkIvL8d7TO/eDheP1VD/T7fCpW/GgyHPyW0tT02b9a8Dr6VPhdf27/2cLa/OmrWPwHSBD8xOoa/qJCMvpNij78EDKq/rRpHvxgpJ78INve+RIidP7pz0T5i9xzA/sAVvudvqL47gmw9i0g5P8eCrj61UHG+FIOYP/VkLj4Xlie/bv08PmL75T8FUGE/y6jWv+EY0zuVk8W+6sMcP2mmk7/woT++EEqyP5KiA8CnaDI/hIjRPnsdKz84AIU/i/lpP1k4VT8cY5e93TiaPx0fDb8zjGC/",
            "au8Nv7lqib9/e9e/TixlPRtwDD/VjQ0/XaMcv6bnID8tg8e/xO/7Plp1jz/305c/BUopP/H5pj5GPjU+vzjrvZ2iwT69TN89U1u1vYV9G0A6ww6/6HpyP+5gLr9tzIe+UPLYPY8IxbrztYo/xWSbv8cMbz9DACg/kCe3Pmwi8z1J/b6/YsGoP5l6Cr7x2ru/Y6KlvnDIOz2HhrS9IdD9vvXYD0DdUMs/xoCLPhGooD4puQu/Y/8HP24koL/b4n+/miJXPXlgzD4+AYy/heAIwGiNlr8TttS/kt83P2DpUb5vdpo+LxGBPdX9G751oS8+DncuP2adHr7Hgwu+vTIrP+o8gb9FUGe+5tt4P7ovmb/i/wC/dVH2PsP5D7+DX1w/y1myv0cCQj27xwC/c7hQv1PXjz9S5pS/SmuevpZ5ZD8HiPg+9V6Ov3uyij82SmA/Ak5kPz4QNr9Y0b4/NuuPPhl5sj9J3PA977dzv5CMmL5UnHS/PQejvwtvl79nhQ0/DUkBPy72PD+OIoO/wBDzP36NHz+LLVC9WM04P03K0b5Rxpm/ZJlWv1EHBj/gYaI/Z7TuvnXvsT+84wW/3icNvr+/OT81LtG/vAsoP3mLEL80gFI+XVaRPbTWWz9OAZE/QG0evrG5pL0+d78+roa0v8Tytz9usXu/alqwvZ5Vez9gUsA/aL5zPxytyT65Q6y96BQXvlwrYb+IlV4+qyMSvRjwFUA0LaW95dTLPi6mfz/QEfi+zQiZv5emGD9tTLi9bih8Pno/7D6m3Wg/tINXPyk9mz+cjp2/wgUUPyRQKMC1+Gk/7fuxP9NUXr+S1n+/FMQzP6qjpb/0u2w/u5WXvyi9gb4pegq/9J/dvnw5zz7i0YK+OvGSP0bCC7+w24E/IqAOwN8YJz/CQ7c9cwuNP7827j/GxK6+aFAjvpnGyb7guJm+zGcAP1tsn7552ca/BzBEP2RpkT8R6ys+fgwEv3lR+b9aAEw+cVjVPSJxID/UT9S+ez+2v8sMjT+nacE/",
            "Tpv+Pt/biz/Nrga+q6CZP+hJBz9RrLC/6+qyvy/K6j53tSG+ckgbvjlv4b6x8ry/KlKJPlMXCj5+gkg/SMjgvpLiJr+Dxqo8cgYFwCo38D8JrIE+eAYAPtn9Lr5TQQu/SIWBv9VHSj4m2gu/ij9yv9L2A707DNu+7QwGwFuUub6GrCI8GL5UP9oq4T7s72u/RjPovyebA8CJrBY/CBrMPlU/br5lPIy/ZQ69PcNDUT/20Fe9XAumv3rxvr/GLPK+mvKqP+D7Hz8bs4I/zBHFv1aYsb86jza/6+AgvhV+Rj973H+/oOsawBSf2z7hurq+hWb0Prv3Ib8FjL0/kHncvaXcGz6uDxI/Fbx5v4KkGsCvULy/KM5bvmLRnT+T4fu6JkZ6PwjCvL5w6YG/XIY9P9kbC7+bVKe/mGq4vhs/Nj8Iq+6+wVhsP+OhKT+9dZs/sTNVv88UYT+jGS6+Ii96v6kWir7gi9c/+v+9PlEtZj8AetU+ii+qvwRpUr/DPbm/ZC4Nvx3WOj4mAIk/KSh5PhfxaLzrFZc+1EJdvIcp+b7k0o6+ObyGv7k+6j+jtCM+xc7pPkYVO7/wfVm/k/ievmy3cr+0hw/AHpOBP/q3VT8WIS7A/mDBP8ybOD8DsX++0thAv2Gvsb9JFas+kM84PynR+z7enJ49dPp5v7iC9T0cfd68F43+vn4kxb/RMQk/pRQUQIz1xD8qDSA+o9m1PqYbbT5siZq/LyuavjQyj7+9JBg/jn5evtfKUb/SWdQ9AEfwPVEuKMC4wni/RfXkPVefID++a4++GmWrPxUuFz86xjK+x9AlPlYVqj+LTnk/yKTIvia9kD9p26y+gDzwvyKy3j5ok2G+gbO9vCsHUr+Ekg/AOG1CP3zfpD+3tFy/OKEovx2ger6L1/q9q5sbv5k+SD/ma4A/QHHgP1eb+T9E3KO/a36gP70EYj+HXN++fkCcvhrJlT/5G2M+p7GMP9Zim73mIJy+Tgtcvkk9i7/ay9m/8aucvwWP+jxWyxTA",
            "eyChP8QiSz58EXc/HDsaP2pjs78ZOmK/juQxP4Eri75mTE085teTvrNIg74XY8K/T9/Zv0WxwL9e7SG+fT0xv/4nIL8KpoG+gouSv92/lj5XJTe+rsEMv1fJED14WxpAndNYvznxMz9COZS/wuqYv18moz/45Q0/5nIDwAZrPb/IXu2+cMhAv6r2Xz+t36I//VBtO8keoz7/AT0/O3eyvEhq6L+Dd6k+HQ+dP8Y0tr9Efx7A+46rv/8kpb+TthI/sO+vP+hVyL8wiIi/itkUv2yX3T/zxhW+PcK7v7lp7j7O3vO/+TkQv6erWb4R/BC/Ho55P39nvD8atsG+2y4GP5G/Zb+9cpa/7DsbPwctD79mfwW/WGFYP4TxhT80Ptq+tQdmPzetNz+7pw3A8kW5Pv8Iaz51v3A/jsDgP0snw71/BOe/cLwivx3PVb3ZMMG/sK0xvoehB78HhgE/00M0vyQFhr9kpgfAtRecvyEiWr9nU4M/5UyGP9yZ8j5hLmu+mesmO6nygr9ARIe/ssYSPtvKzL8yvwTADDIWviKGsj/MAgc/7n6MPiChej/ALM09/nGkP2xgIr/TS1C/Ij3XPduchj6qWl4/xvemvyI9RL71LTE8JWe1vhEFw7z2sny/ZpJEPi5sXT8WXa4+qN3Qv9ygBT+Da3m9t4ZIv8zj1T/NJd8+ffwEP2rnLL8exQw/L3wPvwqBNj3/+92+I108v5iyFEAwE/S+LbK7Pf3+Jz9aV2i/dJ3sPvDwpj7p/cg/aRWhvSX1sL+k5pk/zCANvsKpwj7x16Q+O1AAPlfuvL/p4XO/k8XJvTg8AT3wyAI/VDfLvOoPEb9xM0W/YcMsvqX9pb7zLuQ/cAWIPsN2QD88IS6/mBVMvzCpPb90RS8/45GFP5QIjb+R/+69PSelvballL7Jp5k/Jf+rPothMb97iKQ/FkstP+H43T09Cio/8ykmvzKbkb9AnwxA6Kuavt77k7/oBh1AOYIXv8Yln79+YlE+sevlPnEkoz44J4o/",
            "8bEkP/2lxT4TCrC+gLiZP+l1TL8/goo/Ih0Mv5g04j35/j2/7P39vo3LWz5o03u/tbsyv3ntHD8MViA/FFWpP14i7D8HovU/dBAhvlSvXD+Xk5s/nq1mP1L82T/lwzy+xb6SPfLqOD9QRTG+nQM2P/9bOL9QTrU/AYr2vwQItL40Sbs+XJnVv300lL/CGO8+Vr3yv3v24T/91Z+/MDi0vsrb5z7mVow/+3gZP/8mPb/sz4o/9cuNvxS8vj/6Tf0+lJ20PzHzXz5UWOI/Q1Apvxr00r9j4OW+CO4YwHcDFz6vlCy+phxkvgHyQL8oZtM9VJKwv2UOPL9eDv2+WM5XP8fcQD/yh1O+UJGSPzwKLEAZhJE/fXxPQOUV5z4M3uS+Md7Wvv5Wpz9Jm2m/DqQkPwDe177CsRq/3TCxvUd6CD9MAs++Pm9DP0R2Mz09yGI/79VbPyV75r6JFVu/7n4Ev1zShT6X+AE/gd3BvptI577C6vk+6vuHPg641j7cIgc/ZZs7Px2h0r/jdta+RtxNP3DAPL2vvE0+R+srPxBPDb+KaWs/HVapv2Qzwz6I6cu/doy/v7bwhz5T9Ge/DgTwO5uiTz+5c5C9cnCiP7ksCb5Piry/8/GVvzbnX78mIwe+DEEjv9R1iD8Vjx8/RtuQPRNvlr9bDSy/hSPuvg62EL5AOek+S+Uev8HpvD1xCb0/1OoBv+nDo79fka8/2nY1P8kET79niIK+cjWnPxTVDsCDYJy+9N1Cu7yUBj5xTgg/p0ZfvmMQXb/41v2/XxD3PiLF4b8TwJ+/rGmZP6/rk7/nNiq/3sgBv2LdoL60Dw/AR0C+PjJ6DL7Abw8/YveJv4+xOb85sT+/B4xYv0fnyz4OynO/FtYhPQFutz+qAgA+xfMOwAKg2T+IpIq+TSbPvyYTub+w7iU/UgXev/LIvr9is7G+J4qIvsqD07+mfYc/ziu8v7RXBEA1edg9RwunvvNOdT8WVn69Pjhsv/Xi1T85Bgy/s+i3PorHQL/TM0W+",
