{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_2",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              180,
              320,
              1
            ],
            "dtype": "float32",
            "name": "input_2",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 4,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_1"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_7",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_7"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_13",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_13"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_7",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_13",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_7"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_4",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 4,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_2"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_8",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_8"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_14",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_14"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_8",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_14",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_8"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_5",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_3"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_9",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_9"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_15",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_15"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_9",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_15",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_9"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_6",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_6"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_4"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_10",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_10"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_16",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_10",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_16"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_10",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_16",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_10"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_10",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_5"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_11",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_11"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_17",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_11",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_17"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_11",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_17",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_11"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_11",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_6"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_12",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_12"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_18",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_12",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_18"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_12",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_18",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_12"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_7",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_12",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_7"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 128,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_6"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_19",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_19"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_8",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_19",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_8"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_5"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_20",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_20"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_9",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_20",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_9"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_4"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_21",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_21"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_10",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_21",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_10"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_10",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_22",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_22"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_11",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_22",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_11"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 8,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_11",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_23",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_23"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_12",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_23",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_12"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 4,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_12",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_24",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_24"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "sigmoid",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_24",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_2"
        }
      ],
      "name": "model_2",
      "output_layers": [
        [
          "conv2d_2",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "ed62b2899b7b81054babf5053e3558f13f2d013c715cde3787809c593bd35298",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      180,
      320,
      1
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            180,
            320,
            1
          ],
          "values": [
            "ObgEP4CN1T8F1CY++U7qPxe2gr91Znk+A3rDPtnZob+d/wS+v90MQEpjoD7C6oe/9X9gP6gxyT88Dp29NMFAvkO/579Bb3c/0wXCP9Npv7xS6N6/cOuOPs6vm795hOw/9SUkvxUwar0ArpU+B9zPP8BxB7+m19O/QheivwzwtD/felG+gJGqv4s6mD9XEd0+dwuzPR6AKD8YKKs/HcAeP5wFUT9efzs+TaSjvfvvNsAeUAE/q+1dP1KDlb9TeOu/UGiLPzz4bD0/iBo//ryBPypFZT514Q2+cv5GPxgM+Dw8ELg/7RKfvhskfb5Lvz6/OHRjwNe9rb/Of/y+cwejv3z5A781Mxu/8PEFv+HaU79qq0g/ayNVvTbr9juy3YI/V5mcvzvgb79pO6I+0bqSv/92Lr8b8Ce/aRCdPlCsjL98lsM9H4ngvfInID993sU8rHLsv/BNMMBRtwtAGoAaPyX+gz/lJRW/Ayi7Ph+pAT/sxWc+RpjhPnVxjb8IFiS+jUqSviw7jb9XDbW/SPlPv7RSvj5oM1E/3tq+v4lBC0CGqH8+66RTP5tTgL82k34/T7adv/05F766wxo/GVZmvr+X8z/k3qM/7nejPufpHL/uyBU+MdMbQJseRcBhDIu/EIbNPgApez4vc4c+4yuvvoJIDr/38MG+2CLAvyCQxj9lqe69JTiDvzHaEb9u10A9I+7kvj05gj/yM1Q+sLXEP6/HubxKCYw/ABPXvpCyTL4vygW/kTArP5Wutz/igLm/p67BPhb5gj/MYjc/cvX0PwlYvz+C79w/LdANv+71vz8wIfc/cKIiPuvSn74dBpg+NhOOPwq4wL5+bE8/nsLYvXQxtb9zZe2+eyoKwNzDi72FYUu/0ajZvx8nij5UN72/MP95vq9TDD8btnG/4ESJv8GqOb6YCli/y1OEv6k3hz/TdNi+L1Ihvm2hCD+84WU/fZulvWEsl73tbo+/FP2LvhAZdT4UO4O/KmCIvpLrIcCOfR0/l+kQP/LUJT8rt2o+",
            "+tYqv+0Me79gbw4/xMz8vv6LAkB8/yU/Fn3RP0eIvT3wOEk+SO/Wv9+9VL6eqme+aHIaP9puKD9XRc6+gf8Uv8N8Lz/JTx6+/nxEvyzRkj8wBhS+l3GgPladzD/S9Sq9m0AIwG9LKb/z8q8/UKYFQJussr5gHJy/ZbaVP7cZjz069kE+UvGBP6/ihb7VEni+t3ywvtqrkr/wgGm/+H67PhmxCb/c5e0+sBxXvw6cXcCL8+y+wdoHv6dYUL7+7Am/gDd0v1gHnb/WfxfAKwPGvZkmC77T4Do+92SDv5+4CT+TMLu8PgHSPhBk+j7hI+I+NT8ZP5oE4b/J67i/iDRRvhnYl7+l4hO+UkvWvhIzcb4dt3Y+lNniv/tDcj8r6Ji/peu0vHUjKb8CXAk/ZJKivgtSxz5BBn2/71J+P/vh+75B2Do+YD4Bvwwz+b6wr8+8Vmb8vjbssD+c5N0/hCjdv+ROGT/Qs1W/NZmvv23FXr/0Vg+/5mQ/v4WLnj6ou3Q+dOeqvxABwb4JUEK/Ljqgvqwurz+tnJW/2AxNP4vwFj8ggLg+VDstP2rs0r3TV42+IR/bvmkJjz8twmM+uwNgPsJKP79yxjFAeJMJP/9jQ7+SxXO+Es4zP76eyD8ItoA/gjohv+cLXz9ZTIe/mBW3v0WxH7/Veii/Q2NzvySWS7xD5V8/UW0rvwQyFzxMiLo9rPRJPoEcqT0qzdy+ABQ3vxtbrr+bjhG/fmR6vjHfLr8Ijd4+hc+cP/pU6L776p8+/tGMP2p8zT6OYNO/sCeiv6KOX78Ofeg9D4gKwIVTnj6nJc+9pQokPeyz5b9sBzq+4TyjvxW5Wz6TwbK/AxVXPha0LL6PE5+/7NU5v5zHor95WmG/AprbPkDInj8OYqY+BydPv1+HNj+LQwPAUpFaPylzM7/q4LS+xHoNP7h09L5nfAE9naXEPrR1pz6tnra/F7I1v+Rd/D0b+50+jj5gP7wcfD8Oz6s/WInJv5hamT7ONck+8Uxovp1Ctj7bqC4/",
            "NA1UvxOm2r+M2I4+mrbpvoIIJr1mUro8+f/bvlbEjD//Wps/1KDavywjmD/nnXa/tvEsP8Xkyj/qlLG+ZTnCPrHZKr9M/GQ/NCiWvZvZtb+wHHo/Wqx0v/YNHkC0xlg/WR+nP1BmGr/R0f29oyURu7wtWb5pKKy/nq3EPZClhz3dn7W/paHUvgjzAb/5cCO/+gq/P4vXAD5lV/e/ajgbwD9N0L9Gf7E/XjKdvsyOuD9eYl8+5Iq+vj59ez/JYQU8QT8rv+zgzD9+T6m+2yPLP4L2gD8VvIA/bX+tv8Ao3b9TnMw/Li5Sv2Iw+b+U3Uu/VfGsPraklj7ZfmU/AI8gP3nEVD/MdoW+v73sPpfcCT8uDaM/tyMXvEW1kz/7Wde/+3xQP9liWr9nRNe+Pe9oP4fFy72ltdK+FLdNvZaB5b5G5n8/fEPdvWqE7z+m7oE/JoqXv7e7CL/uYaS+yScOPyXEPT8jcSK/6Bu5v4kAAMDTwDw+dnHcPLEMHT809hW+nSiWPTs5SL3JVWK9cuyMv2swJ78mzlA/zcTJPfvkA8Ame3I+EdEXv8jTwb33cpy+p+xKvl/yA76NaKs/ttOlvp/CPD9vWps/mWVCwLN1WD8DIOo+u28Fvkz9lL/gZoC/APk7vnWXdz67bao/G4a9v/6VPb/0iJE9Tg/JP0IiOb/CQI+/CgKuvk2QEL/MgYW+FKtKP5bAJMC8vwO+DKzyv7gVYb/Nmok+UfYWv2wOSz9RzQs/++6Evyid5z03ugQ/TDgzP21DLD9yXde+Grzvv0Z+8D9mLQ9AXaM1PqPPtr+KIDc9aXKKP/SnnL9GHoE94/AewLHQQL/pLq6/q+w/v4yMQ7+9Eyk/xGIiv9Pfjj6Du4S/SEW/v65Jbb9g4dK++o/1v5pmhj1GTp2/R4n5PnufbT+4QHY/QB/2Piq0Xr0A6GO/2EODPzKabb/K/NQ+wKyzPievI8AXzxs/EIhAv7RFaD+VnAE/5gk0v0qOGz9QccS/pwCFPhLjFz/WLFw/",
            "CfZxv1pVMj9Qvxc/2Wemv39EiL+6BTG/dp+qv//1I8DAaA9A4i+Hv9j4xD+SUh6+ggW7vqqMDkBCNZG+VvaqvxGul7/6uhY+nwpXv9LcAD/++Bc/FiBjv+zZI785sLO+dsV+v/y9nT6nshXAMUK2Pymxlz/AHFG/UdelvrPr+b8GOKq9aU8Wv9ehNz8OF9q+8JEOv49TRj9/9Oo+09GIvxHE5D833oi/B3DlPoCsL7+t/uw+j2XDvrU8LT9hFIY/9vWbPwPilL+mya2/4SPMv44GG8AbUae+H+0iP5rCqT6QnlG/SwVUvvMbir/2FBA/cy5tvp0ycD6SKBo/I0vjPuZWBD+pYEW/RFBwv54lG78HQmu/qtkav/Cigj/W+Zg/nJ1kP3VyF8CAbjU/xbG1P3KPMT8a5oU/177uv3HesL7IkZS+Sp5Vv8N5Cb8EtLG/rbcQv2zV0D8q01m/kOEpPqItyL6hJ8S+fO0XPvVI4L3hFvC+omYgP8D+QL9UAZu/7F44vxJoOb9bT1O/mPHuP3bGhz4ra8S/vEmIvvKkzT1nCEI+z2ipP2dRKr8ipVo+bwqgPzy2oL+1Hmw94jalvzMInj70k4W+gBzMP8Yiij+mSiY/Rt6pv8C+7T5HXxPAN4R3P/Opoz6XAI8/4D1gv7avbD68Gy4+rYEJP2B0ST4qwr89oTb+PuWqgT7SEHo9Gw9qv2UAAj+rQ6C/zEFxP74Rwj5Zfa6/dNwuPzFuJj7IPCq+n/2Jv4p+Mb/8Eas/H3X7v0qtAD7mIx2/zWlDv2bgJr88IhW/hu2SPvzpjb+04Mq9iLQKPweHMr+guAM+h/OlPcx4hr9AYhE/huJivvKE3z9kz2k+9U1bP+GWgD/dTby/Ewq2Pq7xNb4TlvY+49kjv85GOz81eqI/RLdeP8kJAsCIaoC/XakAwGVufT/l5Ck/JasDvYMFqL+NDV6/X5oYwHQ8972FWfM9ZHGlP4/UUr8qrcc/u/D4P0bA4T2j9vg/I/XWvuD15b8Bsk2+",
            "x8Fhv8I44T/KtMc/frV6P5CGWj4AVN4+TOutvhQKlz8/FSM/xLzDv7yq7T+ashw/9tZwvkdHaD9cBQg/HnjMv34rcT9aTLA+4RrXP6LCCz6fpM4/Fa+FPgDwdb925cw+42GAPazJz79zwVK/HyedP873UD/dUre+mRKMvmmpg7+w4p4+mxWaPpyMdr+Kdp4/9CKvP7NYuT3zZCc+1m0KQEL6MD85Crs+8ySmv2QmCL/7XqG/E2W1v5azcz86KrK+5UqDPlTkpb/WD6y+CE3+Pp0LKb+VQAy/ziYPvy8TD0B7F+m+U4QGPpBZgb2chcO/rVydP3Ia8D5Mb2K+9f2Ev2y0Z77eyWi/P/ngPkUZ0T56QT6+tWYbP9ifNr+klpg/3T+6v6t/WT9PnYA/y06wvW96qL9NjYi/1/lgPCtD4TyyA3Q/mxvOvhzhF78OopE8ORLXv2Q1kL43C4K/dsZEPxzb378Nj4S+8nyLvw33xT/pVVW+QfTFv3qmuj871Ua/zSifv6gvtb7+xKG/6+2dv+O1/T0PK8Y/q3ZlP2QzTT7sNIq/1HY7v3jUPT9Izdu+jy+qPz3J3D4LqIo/QFIPv05JAL++m7A9klYvv2G6aj5BxYE/0js1vtaoyT91loY/gmajvjcsB795dZI/DmloP1Uwar+7Hqa+1QPEP3Ijgj5l0p06/oinP0stdT9opAA/W23kv5kKFT8g9bw8U9mgvlPes78kF9o8JqtBPvV15T9CC26+NXS3P4GT1b+M/o6/cHm2v9kAsb9ISwC/GHRQPtZEYz9BdFw/o+nGPySio76uKoe+4OlTPn3Kgj/bz5C/lQ8AwMHHy7/4xkw9FAIsPw1Xcj4WtP29dmftPo3wL785fsG+xUVEP6fulb7cj2o/jTsGP+AqMz/zLr4+dLH/v/2dyz7hfUw/TnGEv8wAAECkWf+/0+aCv7O3rr/Ke5K9Fjbqv9ZDcb8O7QHAF60wv08Vr74nJUm/GqKSvwvTTT5yE2Q/tmqRv4FFCr/6QCI/",
            "8myrvzNdyb8NIXa/putpvyqFE75DbwK/7+FtPurnBkAYdBO/nHGmP2ygXj5Wa4a/Sk+hv/mwE7+8rhQ+Vm8wv95QuL6WUxTAv1mcvwa+XL9apXM/yOO7vxaktT1YmiE/JHvrvq+Jyr+fkza/pYKZviI20T4Ph/8+V3eKvxG/8L+tlZW/T46VPxMoKT/kP8++oHbNPqaHvj9l7do/3+KJPiehWL7qf6e+pn8fQHmFrz4d214/i25LvgsncT7NfoQ/0fGRv63czj9ITVE/ekHUv2PYCD8azcU/HggEP6u4mr91U7A+vGiZPYUUhr+JJj6/e3KDvzHMcr+lyS6/LOFXv1Kgrj3Rg4k/liu3vz3xUb6HojE/lXiJvrAR2r9A+v2/PfQPv5CtnD49tvg/SFCePKs+gz+h5xg+9mvXPqTcLr8+XE+/cWyGvknTpz/jiIw/psXxvWGFmr/ImoO/OqwxvxAdlL8ECdo+Pc9GP+Of/z6Rhcs/PZ74P6D4xz+lC/Y+UkCCPNxdb7/fJca/FwWzv98trL8qltc/KXYOPwKKn7+LWcG/NdS8PWmADz4lZbq+NPWgPoalIb44xlA/A0/gvgwUij4CDAi+uqw5vmSTiD55VE6/j7ZHP8vCtr8MIaI/S/cDQN3sYD+22aU+NP+SvoKNUT4umBO/XeRtPtQGBL+0BHm/etfJvmi3GT+T4oo+ELbCv8w4mL7S8Nk9eUMKv3+KzL9Jypm+Bl3FPUG8dj/CFsE/FQ7RPndRjr/hwee/sBWRP8m1wb6JYqA+Hln6Pouw9D+uFVm/bom8v3HDMD52QhRACABMv/hfyb9JaTo/4Ltlv7mzjb/uUYK/WpYSPsPBbb+YsZk/8GkGP9H/LD8+VCE+AftYveL2F79bksw/QxoNv3jHOT+MIww/Fa6fPv3JdD/wC5c/fGFKv1CACr7EZHY/l+7XPujLQj8afwC+pv2oPmPs3T8pPv2+sO89v8g+Aj/tYxO/MjLVv//vV74kI1i+Ri98vxE5jz9jLLc9",
            "T01nPggIkz9qUNI/zHGlvmbeH8ACEWY/01C0Pmzdhz+5foO/XlYVPZvxkT+Cc1o+mfUrQH50AT6vTRI/hMfOvhD78j6HRdO+fzmNvrGWxD6s+ji/1Yurvt/x5z1O4qO92kNWv0c4Mj7oRLE+oNZmvTnlH0A1fFK+cmIvv0k3KT9eClq+7X+CvyymiL/+TYc/2jY5vwnuA8BWKPC+mcOcv+hpIj1NJ+++9Ms9vk8h4z8ovQtAGOKFvy/Cbr5xS9C/Tg2NvfSBqb0+mKu+R8+7Pk74wb9zZ/e9v/Y+PjJLHD/qOES/MGgrvwLI3r673wg/I1IlP0hacb7HxjE+NNDcP4Me3b8SyYC+3MzmvftXij9MoEu/3ssCv3vYH8CO/c0+lKzJPutKFr+dQnK+g+L7P+PJRL6/9gS/sG53Pl6y8j7X3ma+73PBPiFMdr8K4M4+R/uFv25iPz+pIhY/gIebv15Tdr8Px7O++YSJPv/6HD9ZdgVABEq2vuirpL8XTXe+guytPxNiMb9f25G+F+0+vqJFbz9DwmM/aclkP7gsc7/xUfY+1T8ivjYdiL/RTV6/G7UAv7H4cT9haS+/cLOHPnH0or9ybyK+dIAWv5pdD74wmLQ91CmAP9/pTj/CI8y/8ZDVv8+AxT7ZZRG7mv75vvMADkBlDNw/YJAwP6Z6dT+8VKO8Zk2rPyL5jb6auWE/ejcQv6RY1r6qaBrAyOuRP1M3XD8cSz+9Z6bFP5P8iD0PicU/FbtOv54hu7wCHaY/nyD0PqTI4j40v8E+EhDPvQR4nj/5vo6+0I+/PhHRNT4413U/tQ+fPltkWb9T1Hq/Ye3gPZoLPj/uJei+6lvOv9TDjz/AakC+m+eMP9keRr8YvL6/ixbDvoVFQz+McDQ/ro94PyNeCUAVeq2/41yQv3msnD/riQi++sCdv+8w2D7Bvbm/lzMDwFf6mL9x1g8/qwU0P2SVTD+78US/ja6Mv1TYuL/slpK9C4vcP3UjOz8GYEO/sciyP9G3Jr9Kc5a/",
            "WmbJvALYLz/YbKy/cn+CP+uDBb9trgxAysfCP9itzb9gdRQ9XlOevZDL77+8Nnu/1hGdvvNIET9f222+ZYCpv0dAjT/5LTa/CZ1dPxWBqL7owKY92RVHv3DCgz/jwci/GmjoPZ2NiD9/Fh4/To5uP/d6Qb8NbTo+k1FqPwFQwTzXQya/7W78PiJT3r5urlG/Ui8EvxO89L6FVAM+ymWcv+qUkj7wLxW/wveCPwFtoj60Di4/Xl+TP3EbFr+A4fg9Smn+Ptl0Vj9KqUW/YTZCvkgesL74QXY9qW3hv+9VMj9uoFG/cXNDPg9YZT+iyg5AnAmqPqqQJMDTJgG/J+qUP3tBez+DJxu/iQYAQATQOb9vCrK/r02UP7j/LT/WdQY++dEOv+EqBj+yPss/YhKTP/LIgD/3ROe8dm4rv0Eo7D/37Fq/ucKoP4UM4j9WUN87T2ooPz7yvb+0xYi+KVXPviuPkz+NRHq8gDNuvaSMwj8uz5W/m/HEP/qv/L7Tjqi9UmDovSw2sz9J6I++NdggvVlCsj8YHbg8nd2Nv7KdT76xI4q+2MnavRlFmj5qpIO/UkG1PyU4mL/h6+K/zBYJvhDXVL/dxym++KzePmABo75J6C0/QpOfPzUxQT8q5J2/AnTrPj/xGT+rtZ8+GR26vL51/T+AJSI/iBe6PvhDm7/UEus8mSZCP72YOj83pwvA2P4MwCSOmL/81Gc+DgPMvQkNub905K4+37qwPdE1UD+uFJA/5z/UvgYMnr/om/o9Z2PHv+sRwz78qS+/Huzwvbb/Gb8vpxG/To0AP92HuL8d9QfAVjlPvmzAqj7oQd4/fHB0P+0Hx7uUsXs7BuN3PunuY77DHau+VXYQP9SiS7+EUzrAw+hqPyaTC8CwrGc/ZI2fP950pj1KyG6/H2dpPyt+n7/hYHO+sNgXv+p+DT/6jWu/lLFovhZ5Iz9aTh89ieXIv1jvir8j8V6/beQtvrKADD9eOju/H9mUP+ABvD4KMw1AFaTOvQa4lb8wT/G/",
            "CSrXv6gY1z4hXJq+QBRRvpy1er+BVYq/Kf/FvTVGH74f8wi/hHWeO0uZQL+Q0jS/4VEwv+eNQz9hio2/TM/Wv9bMeb/b+4Y/Y7GLv5zya78SaD69D+EIQC8ReL/tSei+rKTGP4WRTD/7Njy/5jc0vp2rXb/V/mw/yt6cvyt6Lr8ZtT09SLmEvqolH7+7X3S9K1+avzC+C0Bz3W8/7h6yP5NJEkCkjim/+IshPlXRg79sJqo9Yg1nPhXGFL8jnKS/pzeMP6Sg1r7ndpu+Uf79vtZUDL5GTXA/HkxNOya5CD4SLqY/SV4rQIIIzL8s7RE/+hVtP5V8hb9q+Hc/4kWzP2B/wD+FHJ6/7Qo/vTZxCT/GRL0/ljWzP5ZZob9+4JS/NiR6v2sNFr8hgek/EP0NwLyEFz7rpsC+1riOvyutfz+uXKs/i9hBvQWjQj9NNJy/b2xFvw3CpT0ktXs+hx7QPTvsbj7sQlY/fl4GP9b/iL6J5cC+qRQuv6GpTb+fNqQ+81ZFP0xUTT9A7Cm+v/kmv0K0qz1T8R6+2aeJvxE9kL50TK+++saxvggcPD1Wr+U9ctynvxFWvT7qJRI/rFXOP2onCz72YNU/RAVuv/NhG78ZXve/Q0GGv2VYiD9JWLm+Y+6fvjgjnL/5y0C+7/Dgvsw73r37u8m/9DqwP1LnhD94vVk/i5MoQISLGr0HqDa/96wewBFVg77Y8lC/UjdhP+y38D7YqBg+5DdDPy56AT+LCIY/3+oMP0g8xL8nhye+/gRpvvFKIT8R20LA8ORbP6J68L63f/++a1YEwAbcZ76yKVU/BfUVP4FHZr9iRoy+ZHHSPzj+9j90U2S/xjBiPw4k+T4R4nQ/T+ukvxBwDj90DSk//2S2uxca8D/dqxs/ZR+aPwxmAEBlrp8/6AwWvYcizT4Sl0K/l9YAP37s4b5OSCA/9x+LvTP7QL6bphO/GqnTv/qMODzZvnY+eEwVv1ps3b/t8iw+Mp+cv9NBHT4pP6i/fRiHvwUfpL7yPMy+",
