{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              180,
              320,
              1
            ],
            "dtype": "float32",
            "name": "input_1",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_1"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_1",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_1"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_1",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_1"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 16,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_2"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_2",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_2"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_2",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_2"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_3"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_3",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_3"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_3",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_3"
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_3",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "dropout_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_4a",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_4a"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_4b",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_4a",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_4b"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_4c",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_4b",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_4c"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_4",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_4c",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_5a",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_5a"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_5b",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_5a",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_5b"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_5c",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_5b",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_5c"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_5",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_5c",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_6a",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_6a"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_6b",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_6a",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_6b"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "relu",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Encoder_CONV2D_6c",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_6b",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Encoder_CONV2D_6c"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_6",
            "padding": "same",
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Encoder_CONV2D_6c",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_6"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_1",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_6",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_6"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_4",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_4"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_2",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_2"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 64,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_5",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_5"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_5",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_5"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_3",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_3"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 32,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_4",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_4"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_6",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_6"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_4",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_4"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 8,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_3",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_3"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_7",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_3",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_7"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_5",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_5"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 4,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_2",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_5",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_2"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_8",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_2",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_8"
        },
        {
          "class_name": "UpSampling2D",
          "config": {
            "data_format": "channels_last",
            "interpolation": "nearest",
            "name": "up_sampling2d_6",
            "size": [
              2,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_8",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "up_sampling2d_6"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 4,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "Decoder_CONV2D_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "up_sampling2d_6",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "Decoder_CONV2D_1"
        },
        {
          "class_name": "LeakyReLU",
          "config": {
            "alpha": 0.10000000149011612,
            "name": "leaky_re_lu_9",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "Decoder_CONV2D_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "leaky_re_lu_9"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "sigmoid",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_in",
                "scale": 2.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv2d_1",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "leaky_re_lu_9",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_1"
        }
      ],
      "name": "model_1",
      "output_layers": [
        [
          "conv2d_1",
          0,
          0
        ]
      ]
    },
    "keras_version": "2.2.4"
  },
  "average_pooling_2d_same_offset": false,
  "average_pooling_2d_valid_offset": false,
  "conv2d_same_offset_depth_1": false,
  "conv2d_same_offset_depth_2": false,
  "conv2d_valid_offset_depth_1": false,
  "conv2d_valid_offset_depth_2": false,
  "hash": "832a6863a1ad9b88ba9f2513dc74b7d1f89e5df36cc3e7f95767a82690eafb06",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      1,
      1,
      180,
      320,
      1
    ]
  ],
  "max_pooling_2d_same_offset": false,
  "max_pooling_2d_valid_offset": false,
  "separable_conv2d_same_offset_depth_1": false,
  "separable_conv2d_same_offset_depth_2": false,
  "separable_conv2d_valid_offset_depth_1": false,
  "separable_conv2d_valid_offset_depth_2": false,
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            1,
            1,
            180,
            320,
            1
          ],
          "values": [
            "WWWTPWvUSz58Ui+/NfmXvZuBsb+hc+U+RSxYvzdFOj3HmVQ/TySHPyUBTj/88dw/SwNqP732yD6XgSq+RZieP7Cgi799sQM/euajv6yZGb+PhXI/YK57v1sgAECwH4y+L2BZPmmV3j4ky6q+o02cP96fvz/X6qO+QK2kPrgkIEC76z6/NkaqP2XSzj/BNiQ9fN2fO5PwaT8AYI8/RIrbvzEnUb9Kz5O/mvSevrefwr4Bmqa97YLJPpBA+L/buBY+1V/avvITCT9JeCg+YSfHvcoMoL+n6qc/XsZSPy459L+uAoY9PegBPwifp7+Oh0k/Amm6vXZsE7+yR8O9dY+7v8LLAT8ABA+/oggbP/gqQL50IZK/zPm9PsvKZL8JwCW/2F/PvSeKJj9oBj+/DqFqv7r8wr6h6Ga/X6A8P42agb87/JC+iPDJPnI6c767aIO/qCAXvw+AeT9TD7E/U7F8v19f0L/CrX8+AUCFPinnHz+I2pk/IAWZPTVJqr6YlwnAuhKDPwck4b2rW7e+EBBCP37o2T83u4Q+UJ4EwC+KWj/rFPk+nig7v4jzZL6cmTK+69eWP8CJj77mVCw+8M5lP0Qo6L6ZiFG8f2invjbwMr/EiEU/Puy4Pi/G/L8oizq/6n4yvks3tj6tVnc++h3Zviy7AL/a1RQ/zA/Yv7T3Gb+6W6S+oHl8vmPMib846gE+Y/dJP/gyHbyJBTe+pxuzv+ZWKsCoXnG/xNESvh6g2L8i5Ow90MUpvm0uyr5ogUi+I03dvt4aMD/lTd8/huxRP3mYvD8TBdQ+DIQSvxPeEb/i/E8/La6GvorzDUAxuzu/ET2Zv+oKub8Ayjc+qRtkv8VhED//vJA/3VlyPyWpaT4SFABALWGdPfyURz7ZV56/pDkJwO4n075CC6K+KXTivlFIxL6oUpK9BnP7PqFpJT82jJS+EEVfvoJNaT/mGtK+qcuUPzgknb131wC/Ib9Yv3DPGb6uugY/2Q0MP+ltlb9Qxq69UeDrvTnX2z+Lhok/",
            "bx0AwHSjP7/q0pe+Fcj+vmfSCL2sPd0+kvaHvzCLSL6MNsc9W8MCv9qZcz7VKaS+I/0Svzfylb8NkQY/I3Qbvse8Mj7V5DG+CZkjPkpUWj+fcBrAQZ70vQYDij9i0Gk/S7yFPtYE27+VNA++yQTmv/miN78oHKe+WBfKvfjuh74RdZO+D8yUvR6fOD9+iqg+SDm8Pmu5fb8dCsy+hjhTPid0pD/5u6+/jZjUvkUB0r/HVXo+D+Fpv4y0/r6mDIm9ze20vTwm/j5bWWC/hlEgP4wowb+r9He/BhmsPv+MWT9wfjq/ZW2NvgnD8D4sKwo/Byw2v9U6zr3HuGC/zmGXP5zkBr6nKSC+r3BMvyYUsL+Clt49q4mqP/Y8XT/6f1I+X2oYP9SFsb5lSki8DJGhvz1Np7/P0KI/8ViyPvAZdz8MD5y/lPSfP5JOLj6ZMBg+PSg5v3Kiuj9mC+8+mat7vyzNhT8g6po+PebtPnGGbr8YzqE/VM6BP0P8Sb/CaF8/uLJsP97knD+0/cq99YPfvd4SLD7z518/9ylgPo4M8j45Vg0+u9aaPrtb/T8pudi+YFJWv6v+jDxBbgQ/fQ35PbBzujvMabc/TcQMv+EFDz9Ouf09qIEnv0xNHD460aw/98acv6ATGr/5UmQ+jl9cPck7Rj9FM9w/8Iz/vCtwgj9ARg6/+ieCv/61vj8KSXU/qx3xvq1LQL/E6qA+zRnpvj3E2D9k9kO/nK4Cvr0Bz74w7Do90Y0mv8aNiD66HRg/QJt+vxC1ML6P9I4+B2UsvjHO/77volc/BKNxv14Whj+nxNs+jc9nvzZIib9uAgY/ro2HviTVnT0zUjm/ZJyNv9o5BD/MAxO/zSgGwHhe1L4felw+kwKmv25xBr86sZi/8e/kPyxfuD6Ybtc+s4WRv1xQbj/esvo/dEirvKZIUD6gQiM/o8WVPsOxDr8/faq/7f2XPpHCubwUiqq+L5E2v8Ve1j3ASlK8XA5cPwjsR79mM/8+kDPCvnqRjb2FihI/",
            "RvKRvldwUz4SU5i/wz6BP+h2vz69iza/FTGXPvCkGsB/Mco/m/PRvjn/Hr9YMYK/D9kEP3jGM74cM9A+mCIuPrxkhz/767Y/9tkjPzfjmj6Y9t48Sa7Av8mRI7+XExPAMHp5vpPO9b/fvck+y8N9v5N0uD9/rJW9QpYOPnxSVT9pGBhALOiOv5hJtj46Ts2/XLEIwMFcpr+fJpM+Q1t9P9wunr/Vu46/ErCYvqUtT79qEZY+MSnpvhstDr5mP5U+ltqoPhsM1j8VBtE/Hw1kP8mlzz5FoxQ/yeUCPmwROL9vDXa/bgSMP7vVSb+H7e0+pepyvqV+8L/W1/a/kSIOvtbPLj4K6c8+HeeIv7R4eb6YSvy/P7gyvwXLTj+zkaq/aRb7v4At1L45kxQ+zmOcPWvW3j+TcgXA4sEcPwLdtz9208K9vnAwv/mYmz7ciKg/7wh5v4WSkb8ZQ3m/OCrwvfvKeD8yhhm/4M6kP4bnbT9ze6m+wvNuv5KlwD6JuYQ/XmuIvyoU1r60PvS/v7mIPiB1uD5+L6s/hcuqP4whCT98bpM8SF47v5CJLr+To1c/Ufr1vmXB2T5LXPk/loscvdpLKb+74KO9LVAfv9Pg6z2qvA4/JPYIvpOf7r5R1YO+tRc9PcmsHT8sdRO/8kJ8P2Bb3j7YWYI++wKsP3q5MsBsxoI9t840vxoc3T8M4Im/FZQ7PgPwi7+LiLk/BO0VP3UnD78QIf6+ypFmP4He4D+q7kq9yp2hP1XjFEATvVq/IjhdP9qnZD9dsDu/0TEpPQ6TPT8RWIa/ZZ29Pq3Uqb1fEo4/8oi8voHcXMAmZ0Y/yqF2P8YbcD+9rBpAiMfVPxLNND9aloU/sLUMPswU575slZo/LoXnP40sJj+BZIM/hlPPPmJgir8FRJk/glYOv8jef76vL38+iTsUPkq0I7/doYg/eX5dvz5EaD1Vcx+/kPTrP2ETTL59TUS+ZR11Pvd1ir/E4Vm/xt/5vpNt47/E3ow/69KXPymLIb8Rk4s/",
            "IdSZvcWvib+MzVc/s8/MPe8AnL9le16+Mk84v80aaL3BxMK/DZKMP2MI+LxBpTU9bzOBP8BlVL7aMkS/N/zovj/ZL77WEk4+x71ZP8QB9j5XhhO/mX3hvzkdtL93tEk/SHRmPmDxOr2l4IU883iqvZtUgT88q1++0reHPzeb/r3aGEa+Ep3Jvr4FBL8BYG6/rWm4P2U0lb9PCkI/ErZpvuqXKb/Aj+q+hQmePl7gBj/fXIM+ptFPP7EYkL8MrgK/KBpRv5CZDT860bK+0LexvmDpiL+abmE/JNqPPRcKmL7F/Gq/sOt3PzyhW79kQitADkuAPwrCAb8mepO/ONJAvzPCJD+B3uw+fo7QvxXM7b/wgog/IXYKv6Bpqz/9XCO/3n26P3Vwo79OMEU+GSO0v6mXhz9Eh3+/fibeviYvGUDsp1Y+8MYPvg7jOMBDMEu+AHzfP4UiLD/UWvQ8hvMMwPR7nz6hG8A+Hri1PeHJBr9CtZe/DbNaP8hHjz+MHmg+Bt9MP66fED/Mwdi+M/6UP9Yttb5y7eK+rV6WP7q4LL+S5q0/raEJPkXkV77MdCs+jLQ2vn+acz8nrgo/pO2nPttB9L+iN9c+I1qmP1cNiD2nEKe/QqOdvzz/5D/KAJe/B68jv2sqhb71OLA/rMaCP8k72r6Z8Gy/OS8FP7JFlL/8C9q/D5hMvqyWxT6l74g9eMPHvrqL+z/yxBC/LteRP6bXdT5QQ/w+qVVXv7KQIL7KIKm/6YagPxxLYj8+t7G/IOL6vh9p8z0hhDY/TPcvvxdxlD4T55A/5vsQQP/JFL/Ptau+rFpGP/kk0zz7BlC/HsnOP/Yv679DJ1u+Du78vydfwT2HaoQ/0DIVP8D6D79wEB6/TDCCv+MNlj9xRTg/Qtkdv6vrrL+j/l2/WXbXPuXo4b0FIAe/RTyQPwZFir9Jx28/FaE2P3hi5T+o4Dg/55xEvVimCD/FNUc/6cTAPa77qz6W284+z0VmPkS+kr/tT5E/ksDlPt0abL+spGk/",
            "Jc7mvtccFj93mWk/qem/P3wVyD5oUJS+53a0v3vqU76I7JC+jJDuPfJu/T/VtE4/9XSYv4T8pz9Jj2o/Vq2zPrvbIb1T7OK+yzG/P10NLL+kRoG+n2ZGP96t3j/kdkq/rQt0v/meLD91/+m+rgrjvqANKz0apxq/Neb3v69Ygb+2bmG9Q6r8PBhv1z2CJ4i/6iFdP7ox+z+K1UI+1GBmvzkSsL9euaQ/PcKwvV/MZL4QVBY/T+K9vweHnb6/HGi/4xKIP4Y5jj9Z08Q9ceWvvnmDob32UX4/JCBwPzs9Oj8qWp+/EqXePzSuQr9A1va+hf5SP+APOT6qeyPAySoHP8sNsL+j/tU/itu7P1LTkz9Q6Ss/XNiDP1ZL/D5LGIq/iuSNv299/L4eCQ4/I2jNv+qB+b9j4Hk/sKXPPuq5sz+F0C+/SEKOv9eMlb+NLpw+w7V3P3yECr/fu4G87sPXvwsQGT94nIU/qc1XQGHcBD8nxhA/FIvVvliGgj/N5RjAMDtvPnKOvz6zZ2U/Yb88P5P+671PSeY9bxOrv4oyAD/HjOe/4kMEQIQRyD4mQPG/bGEzvx1XgT/jHZ0+raGOP04fBT71CXe/ZfYUPU7fhT91DtA/8uEVv8O2Fr5j3Sw/czKcPsmSVb60RXm/aeGoP5Uqoj6rVga+OHUnwBuAbT9Dc00/AsLkv0IEtD8OUSU/2yRCv/P1Cj/Dzqo+zDkCP3cwz77c/a4/eaZqv80Jlz6m68C/sDiSP/EQKr9XQEg/DCpXP7RWwj8wt7i/stw1v/nHi7/CybY/QkY1v9bFob5kHKI+zbGDP52pDD/yTQY/7+aav+Xqe78fkIi+JqApvybcuD8l49w+yysRvn1SUz/C0sm+tL+VvtYYfj5nOYm8reD+vOxP3r4hcds/jU9cPnK1CL+LEU0/wAr6P+cAmr/0yfK+NvmbP31L7j+QKdO+u6SCvD+dJj/qUe2/KdebPgt5+75OSSs/HGczwCSNvD4IArC/ICnZPvaQnj5SxXk/",
            "krsbP2bub7/bPLM/3UXHvzegcb4/MI0/3bKXvybXvL9itgc+kWJFvy2sWz93dAU/IBwePu6H879QHn+/a70Tv66htj/Y84M/ZaPPv+kbcr2Yd5q/RuTNv8zNc74qJxo9rNmlv2ak7z0l8R8/yFO3Py8I2b5Xpg4/A5mhvmDKpr/R3Oi+4FjFPrhQTD9nrEa/5UbPvky1nr+zuFI+jVTjPbBLAr+BrJ4/XVfzPmfoXj/JymU+bbCmv8M8xL6u942/jKSXP5/l0j4DkpW/TJ0JP+sVxr9WFEM9xLxjP8I5fD+4YtS9ty4lv198Cj6U9Sq+ifhcvgqYBcCxuWu/yd22Px+bE8Db3c2/vlH1Poiosz5F78U/nqylPwOmdT+2n4O+bt0BwJ2eZD9dfmw/VwWyP8n/S7/7k8C+EPmcP+AJr7/M52E/XTp/vn6Tp74YWR6/59LkPk7ydj/+IYs+LFY9vmRiQj1fqqu/1j3Uv6SC7D+ihwk+LDiAPZZQ0L4HGq2/0p1HP2U3u79at4O+fKU+P/OSAsBDqQY+pjwYP1sAR7/uju0+UqaWP/rXYD/x2Uk+q+5tvRaY1z8pJ3G8JzCgv2Ciyr9DUxU+uNNIP3TU9D7rWyY/WrJivb+5S745hsk/SwOnPz+Dx78xGYC/rhyuPvCpq767/QRA5V+lPydcBECoxO0/oiIVQGxQrb9175e/wYIhv2ksUT/AnWS/mkvjvcjNmj7udOO+oUCvP3AzlzsyOz4/8hUcPxF1PL5DkF2+Ru60PQBfsb/be6I9wYzIvp2MOb5lWIa/oE/Zv2uHU78UQb0+FIqRP55Aub/SgJE/m1kkv4QXKz/474E/MLXGv2NvEb5ubWm/ctH8Purg0j8elpa/ahOqPl2xjr5bIOE+3a0HQMM94j5U8rw9O3KFP7juwz85yok+Bo4QPmJsQj8fwdw+80Dzv+Hhg7/lSZs/itxZv8ENOD9GiyY882pCP3MAw7+obPK9Y30Lv2pEzT9UPcc9/ZiEPw0Y5z/o5uS/",
